config/cf/InformationRegisters/СвязьКомментариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СвязьКомментариев</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комментарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комментарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/InformationRegisters/СвязьКомментариев/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьСвязь(Знач РодительСсылка, Знач ПодчиненныйСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РодительСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи 			= РегистрыСведений.СвязьКомментариев.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Родитель = РодительСсылка;
	МенеджерЗаписи.Ссылка	= ПодчиненныйСсылка;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОчиститьСвязь(Знач РодительСсылка, Знач ПодчиненныйСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи 			= РегистрыСведений.СвязьКомментариев.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Родитель = РодительСсылка;
	МенеджерЗаписи.Ссылка	= ПодчиненныйСсылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
